app/controllers/api/articles_controller.rb

    def index
      articles = Article.order('id DESC');
---
SELECT "articles".* FROM "articles" ORDER BY id DESC