app/controllers/api/session_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@freksidea.com"], ["LIMIT", 1]]
---
    def create
      email, password = session_params.values_at(:email, :password)
      user = User.find_by_email(email)