app/controllers/api/users_controller.rb

SELECT "users".* FROM "users" ORDER BY id DESC
---
    def index
      users = User.order('id DESC');

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
      user = User.find(params[:id])